class Team < ActiveHash::Base
  self.data = [
    { id: 1, name: '--' },
    { id: 2, name: '秋田ノーザンハピネッツ' },
    { id: 3, name: '横浜ビー・コルセアーズ' },
    { id: 4, name: '新潟アルビレックスBB' },
    { id: 5, name: '富山グラウジーズ' },
    { id: 6, name: 'レバンガ北海道' },
    { id: 7, name: '宇都宮ブレックス' },
    { id: 8, name: '千葉ジェッツ' },
    { id: 9, name: 'アルバルク東京' },
    { id: 10, name: 'サンロッカーズ渋谷' },
    { id: 11, name: '川崎ブレイブサンダース' },
    { id: 12, name: '三遠ネオフェニックス' },
    { id: 13, name: '滋賀レイクスターズ' },
    { id: 14, name: '京都ハンナリーズ' },
    { id: 15, name: '大阪エヴェッサ' },
    { id: 16, name: '琉球ゴールデンキングス' },
    { id: 17, name: '信州ブレイブウォリアーズ' },
    { id: 18, name: '島根スサノオマジック' },
    { id: 19, name: '広島ドラゴンフライズ' },
    { id: 20, name: 'シーホース三河' },
    { id: 21, name: '名古屋ダイヤモンドドルフィンズ' }
  ]
end
